  <div class="row">
        <div class="col-lg-9">
            <h1>178.Rank Scores</h1>
            <div class="markdown-body" style="margin-top: 20px">
                <p>Write a SQL query to rank scores. If there is a tie between two scores, both should have the same ranking. Note that after a tie, the next ranking number should be the next consecutive integer value. In other words, there should be no &quot;holes&quot; between ranks.</p>

<pre>
+----+-------+
| Id | Score |
+----+-------+
| 1  | 3.50  |
| 2  | 3.65  |
| 3  | 4.00  |
| 4  | 3.85  |
| 5  | 4.00  |
| 6  | 3.65  |
+----+-------+
</pre>

<p>For example, given the above <code>Scores</code> table, your query should generate the following report (order by highest score):</p>

<pre>
+-------+------+
| Score | Rank |
+-------+------+
| 4.00  | 1    |
| 4.00  | 1    |
| 3.85  | 2    |
|&nbsp;3.65  | 3    |
| 3.65  | 3    |
| 3.50  | 4    |
+-------+------+
</pre>

In [1]:
import sqlalchemy
import pandas as pd
engine = sqlalchemy.create_engine('mysql+mysqlconnector://root:newpass_1234@localhost:3306/sys')

In [3]:
pd.read_sql_table("Scores", engine)

   Id  Score
0   1   3.50
1   2   3.65
2   3   4.00
3   4   3.85
4   5   4.00
5   6   3.65

In [38]:
## Method 1: Create a matching table
query = '''
SELECT Rt.Score, Rt.Rank
FROM Scores s
LEFT JOIN (SELECT Score, @c := @c + 1 'Rank'
           FROM (SELECT DISTINCT (Score), @c
                 FROM Scores, (SELECT @c:= 0) c
                 ORDER BY Score DESC) r) Rt
ON Rt.Score = s.Score
ORDER BY s.Score DESC
;
'''
pd.read_sql_query(query, engine)

   Score  Rank
0   4.00     1
1   4.00     1
2   3.85     2
3   3.65     3
4   3.65     3
5   3.50     4

In [40]:
## Mathod 2: Subquery in SELECT part
query = '''
SELECT a.Score,
       (SELECT COUNT(DISTINCT(b.Score))
        FROM Scores b
        WHERE a.Score <= b.Score) 'Rank'
FROM Scores a
ORDER BY a.Score DESC
;
'''
pd.read_sql_query(query, engine)

   Score  Rank
0   4.00     1
1   4.00     1
2   3.85     2
3   3.65     3
4   3.65     3
5   3.50     4

## Note:
# Time:  O(n^2)
# Space: O(n)

#### 1. The main idea is to find a matching table first either sequentially or directly.